meeting/agenda/2026/03-24.org
:PROPERTIES:
:ID:       8534CA33-A71D-47AE-8D3C-02D065C80425
:END:
#+title: QT4 CG Meeting 157 Agenda 2026-03-24
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT).

Note: Daylight Saving Time began in North America on Sunday, 8 March. It does
not begin in the UK and Europe until Sunday, 29 March. The QT4 CG
meets on UK and European civil time. The meeting of 24 March will
be *one hour later* in North America.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2026/03-17.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for 24 March 2026.

The next meeting is planned for 31 March 2026.

** Review of open action items [0/13]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

+ [ ] QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests
+ [ ] QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.
+ [ ] QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday
+ [ ] QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion
+ [ ] QT4CG-156-01: MK: add reference to data model in F&O 9.2
+ [ ] QT4CG-156-02: MK: think though implications on strings arising from duplication in specs.
+ [ ] QT4CG-156-03: MK to revise PR #2516 in light of the comments. 
+ [ ] QT4CG-156-04: CG: Related to #2313, make some minor changes to the explanatory note.

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2533][#2533]]: 2528 Update RFC reference (7159 -> 8259) for JSON 
+ PR [[https://qt4cg.org/dashboard/#pr-2516][#2516]]: 2433 JTree function: Discuss JNode identity more fully
+ PR [[https://qt4cg.org/dashboard/#pr-2470][#2470]]: 1310 Functions fn:regex and ?matching-substrings
+ PR [[https://qt4cg.org/dashboard/#pr-2345][#2345]]: 2299 Expand pipeline to allow arrow expression in path expression
+ PR [[https://qt4cg.org/dashboard/#pr-2266][#2266]]: 540 system-property equivalent for XQuery
+ PR [[https://qt4cg.org/dashboard/#pr-2160][#2160]]: 2073 data model changes for JNodes and Sequences
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2534][#2534]]: 2408 More misc editorial changes
+ PR [[https://qt4cg.org/dashboard/#pr-2532][#2532]]: QT4CG-154-01 Mark anyAtomicType as abstract in schema type diagram
+ PR [[https://qt4cg.org/dashboard/#pr-2530][#2530]]: QT4CG-155-01 Add comparison of path expressions / lookup expressions
+ PR [[https://qt4cg.org/dashboard/#pr-2529][#2529]]: QT4CG-155-02 Clarify that 59.9999 is valid but 60 is not

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2502][#2502]]: Rounding dates/times and durations
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2496][#2496]]: EBV: maps,  arrays, QNames
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2461][#2461]]: Unparsed entities
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2454][#2454]]: Grammar: literals & constants, negative numbers
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2381][#2381]]: Add facility to serialize binary values as url-safe base64 encoded strings
+ Issue [[https://github.com/qt4cg/qtspecs/issues/2198][#2198]]: Serialization parameter: `conditional-cdata`

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2548][#2548]]: 2547 file:delete: rules and error handling revised
+ PR [[https://qt4cg.org/dashboard/#pr-2546][#2546]]: 2455 file:copy, file:move: creating targets
+ PR [[https://qt4cg.org/dashboard/#pr-2543][#2543]]: 2542 subsequence() takes xs:numeric rather than xs:double
+ PR [[https://qt4cg.org/dashboard/#pr-2541][#2541]]: 2525 JNodes: map constructor
+ PR [[https://qt4cg.org/dashboard/#pr-2540][#2540]]: 2535 File Module: examples, editorial notes
+ PR [[https://qt4cg.org/dashboard/#pr-2539][#2539]]: 2524 JNodes, lookup expression: coercion to maps & arrays
+ PR [[https://qt4cg.org/dashboard/#pr-2538][#2538]]: QT4CG-156-02 Follow on from 2520, esp re non-XML characters
+ PR [[https://qt4cg.org/dashboard/#pr-2350][#2350]]: 708 An alternative proposal for generators
+ PR [[https://qt4cg.org/dashboard/#pr-2247][#2247]]: 716 Deferred Evaluation in XPath - the f:generator record

*** Required for V4.0
:PROPERTIES:
:CUSTOM_ID: required-40
:END:

The following issues are labeled “required for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/1777][#1777]]: Shallow copy in XSLT with maps and arrays
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1584][#1584]]: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility
+ Issue [[https://github.com/qt4cg/qtspecs/issues/675][#675]]: XSLT streaming rules for new constructs

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2548: 2547 file:delete: rules and error handling revised
:PROPERTIES:
:CUSTOM_ID: pr-2548
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2548][#2548]].
** PR #2546: 2455 file:copy, file:move: creating targets
:PROPERTIES:
:CUSTOM_ID: pr-2546
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2546][#2546]].
** PR #2543: 2542 subsequence() takes xs:numeric rather than xs:double
:PROPERTIES:
:CUSTOM_ID: pr-2543
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2543][#2543]].
** PR #2541: 2525 JNodes: map constructor
:PROPERTIES:
:CUSTOM_ID: pr-2541
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2541][#2541]].
** PR #2540: 2535 File Module: examples, editorial notes
:PROPERTIES:
:CUSTOM_ID: pr-2540
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2540][#2540]].
** PR #2539: 2524 JNodes, lookup expression: coercion to maps & arrays
:PROPERTIES:
:CUSTOM_ID: pr-2539
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2539][#2539]].
** PR #2538: QT4CG-156-02 Follow on from 2520, esp re non-XML characters
:PROPERTIES:
:CUSTOM_ID: pr-2538
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2538][#2538]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
