meeting/agenda/2026/03-24.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 157 Agenda 2026-03-24</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 157 Agenda 2026-03-24</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>
<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 12:00EDT).
</p>

<p>
Note: Daylight Saving Time began in North America on Sunday, 8 March. It does
not begin in the UK and Europe until Sunday, 29 March. The QT4 CG
meets on UK and European civil time. The meeting of 24 March will
be <b>one hour later</b> in North America.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>
<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>
<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>
<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>
<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2026/03-17.html">the previous meeting</a>.
</p>
</div>
</div>
<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for 24 March 2026.
</p>

<p>
The next meeting is planned for 31 March 2026.
</p>
</div>
</div>
<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/13]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-143-02: MK to try to recover the ability to extract formal equivalences into tests</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-144-01: MK to consider if any now lost value comparisons should be added as examples.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-01: NW to ask Jirka for a room at XML Prague for Tuesday/Wednesday</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-150-04: NW to see about a status update on PR #2345; possibly schedule discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-01: MK: add reference to data model in F&amp;O 9.2</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-02: MK: think though implications on strings arising from duplication in specs.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-03: MK to revise PR #2516 in light of the comments.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-156-04: CG: Related to #2313, make some minor changes to the explanatory note.</li>
</ul>
</div>
</div>
<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>
<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2533">#2533</a>: 2528 Update RFC reference (7159 -&gt; 8259) for JSON</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2516">#2516</a>: 2433 JTree function: Discuss JNode identity more fully</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2470">#2470</a>: 1310 Functions fn:regex and ?matching-substrings</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2345">#2345</a>: 2299 Expand pipeline to allow arrow expression in path expression</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2266">#2266</a>: 540 system-property equivalent for XQuery</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2160">#2160</a>: 2073 data model changes for JNodes and Sequences</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
</ul>
</div>
</div>
<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2534">#2534</a>: 2408 More misc editorial changes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2532">#2532</a>: QT4CG-154-01 Mark anyAtomicType as abstract in schema type diagram</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2530">#2530</a>: QT4CG-155-01 Add comparison of path expressions / lookup expressions</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2529">#2529</a>: QT4CG-155-02 Clarify that 59.9999 is valid but 60 is not</li>
</ul>
</div>
</div>
<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2502">#2502</a>: Rounding dates/times and durations</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2496">#2496</a>: EBV: maps,  arrays, QNames</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2461">#2461</a>: Unparsed entities</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2454">#2454</a>: Grammar: literals &amp; constants, negative numbers</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2381">#2381</a>: Add facility to serialize binary values as url-safe base64 encoded strings</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2198">#2198</a>: Serialization parameter: `conditional-cdata`</li>
</ul>
</div>
</div>
<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2548">#2548</a>: 2547 <a href="delete">delete</a>: rules and error handling revised</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2546">#2546</a>: 2455 <a href="copy">copy</a>, <a href="move">move</a>: creating targets</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2543">#2543</a>: 2542 subsequence() takes xs:numeric rather than xs:double</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2541">#2541</a>: 2525 JNodes: map constructor</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2540">#2540</a>: 2535 File Module: examples, editorial notes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2539">#2539</a>: 2524 JNodes, lookup expression: coercion to maps &amp; arrays</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2538">#2538</a>: QT4CG-156-02 Follow on from 2520, esp re non-XML characters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2350">#2350</a>: 708 An alternative proposal for generators</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2247">#2247</a>: 716 Deferred Evaluation in XPath - the f:generator record</li>
</ul>
</div>
</div>
<div id="outline-container-required-40" class="outline-4">
<h4 id="required-40"><span class="section-number-4">1.6.5.</span> Required for V4.0</h4>
<div class="outline-text-4" id="text-required-40">
<p>
The following issues are labeled “required for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1777">#1777</a>: Shallow copy in XSLT with maps and arrays</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1584">#1584</a>: Review the XML Schema and RELAX NG schemas for XSLT 4.0 for compatibility</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/675">#675</a>: XSLT streaming rules for new constructs</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>
<div id="outline-container-pr-2548" class="outline-3">
<h3 id="pr-2548"><span class="section-number-3">2.1.</span> PR #2548: 2547 <a href="delete">delete</a>: rules and error handling revised</h3>
<div class="outline-text-3" id="text-pr-2548">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2548">#2548</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2546" class="outline-3">
<h3 id="pr-2546"><span class="section-number-3">2.2.</span> PR #2546: 2455 <a href="copy">copy</a>, <a href="move">move</a>: creating targets</h3>
<div class="outline-text-3" id="text-pr-2546">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2546">#2546</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2543" class="outline-3">
<h3 id="pr-2543"><span class="section-number-3">2.3.</span> PR #2543: 2542 subsequence() takes xs:numeric rather than xs:double</h3>
<div class="outline-text-3" id="text-pr-2543">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2543">#2543</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2541" class="outline-3">
<h3 id="pr-2541"><span class="section-number-3">2.4.</span> PR #2541: 2525 JNodes: map constructor</h3>
<div class="outline-text-3" id="text-pr-2541">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2541">#2541</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2540" class="outline-3">
<h3 id="pr-2540"><span class="section-number-3">2.5.</span> PR #2540: 2535 File Module: examples, editorial notes</h3>
<div class="outline-text-3" id="text-pr-2540">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2540">#2540</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2539" class="outline-3">
<h3 id="pr-2539"><span class="section-number-3">2.6.</span> PR #2539: 2524 JNodes, lookup expression: coercion to maps &amp; arrays</h3>
<div class="outline-text-3" id="text-pr-2539">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2539">#2539</a>.
</p>
</div>
</div>
<div id="outline-container-pr-2538" class="outline-3">
<h3 id="pr-2538"><span class="section-number-3">2.7.</span> PR #2538: QT4CG-156-02 Follow on from 2520, esp re non-XML characters</h3>
<div class="outline-text-3" id="text-pr-2538">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2538">#2538</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
